<template>
  <modal name="TermsModal" width="650" height="650">
    <div class="modal" id="Terms">
      <div slot="top-right" class="btn_modal_close_t02">
        <button @click="$modal.hide('TermsModal')"></button>
      </div>
      <p class="modal_title_t02">이용약관</p>
      <div class="modal_content a-c">
        <!-- eslint-disable -->
        <div class="specialty_box">동화기업㈜ (http://www.dongwha.com'이하 '동화')는 개인정보보호법 및 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 ‘정보통신망법’이라 한다) 등 개인정보 관련 법률에 따라 이용자(정보주체, 이하 동일)의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다. 동화의 각 사업부문이나 관계회사의 경우에 해당 사업이나 관련 업무의 특성에 따라 별도의 개인정보처리방침이 운영될 수 있으며, 이 경우 각 해당하는 별도의 개인정보처리방침이 우선 적용되오니 해당 웹사이트에 공지된 개인정보처리방침을 확인하시기 바랍니다. 동화는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다. 본 방침은 2019년 3월 1일부터 시행됩니다. 제1조 - 개인정보의 처리 목적 동화는 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전 동의를 구할 예정입니다. 가. 입사지원 및 결과 확인 회사는 허위 또는 대리지원을 방지하고, 채용전형(서류심사 및 전형결과안내, 직무배치 등)을 위해 입사지원서 상의 개인정보를 수집하고 이용합니다. 나. 회원 가입 및 관리 회원제 서비스 이용에 따른 본인확인, 불량회원의 부정이용 방지와 비인가 사용방지, 가입의사 확인, 분쟁 조정을 위한 기록 보존, 불만처리 등 민원처리, 고지사항 전달, 동화신문고 제보 및 이에 대한 회신 등을 목적으로 개인정보를 처리합니다. 다. 마케팅 및 광고에의 활용 신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 콘텐츠 제공, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다. 라. A/S 접수, 처리현황 확인 서비스 및 상품과 관련된 A/S의 접수 및 이의 처리 등을 목적으로 개인정보를 처리합니다. 마. 파트너스 서비스 제공 오더 입력 및 취소, 매출내역 조회, 여신현황조회, 배차현황조회, 클레임 접수 및 처리 등 바. 동화컬처빌리지(연수원) 관련 연수원 이용신청, 관련 협의, 마케팅 용도로 개인정보를 처리합니다. 사. 계약 체결(거래처등록) 및 관리 거래관계의 설정 여부 판단, 계약의 체결, 설정, 유지, 이행, 변경 및 관리, 채권 관리 및 추심, 신용조사, 실명거래 등을 목적으로 개인정보를 처리합니다. 제2조 - 처리하는 개인정보의 항목 동화는 온라인에서의 회원가입 및 각종 서비스 제공, 오프라인에서의 업무처리를</div>
        
      </div>
    </div>
  </modal>
</template>

<script>
export default {
  name: 'TermsModal',
  data() {
    return {
      active: false,
    };
  },
  methods: {
    onChange(e) {
      console.log(`checked = ${e.target.checked}`);
    },
  },
};
</script>

<style></style>
